run/rockerPlate/rockingPlate_half_b/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     biotFoam;

startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         20;

deltaT          .05;

writeControl    adjustableRunTime;

writeInterval   .05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable yes;

libs ( "libsolidModels.so" "libSoilFvPatchFields.so" "libOpenFOAM.so" "libcontactModels.so" );


#include "Functions.H"


// ************************************************************************* //
