run/rockerPlate/rockingPlate_half_b/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPointFace;

setFormat raw;

sets
(
    Profile1
    {
        type            uniform;
        axis            z;
        start           (0.4 0 -0.12);
        end             (0.5 0 -0.06);
        nPoints	 200;
    }


);


fields
(
  liqueCriteria
  f
);


// ************************************************************************* //
